#include <iostream>

int main() {
    
}

/*
Разработайте упрощённую модель умного дома для дачи. 
Выполните симуляцию его работы на протяжении двух дней. 
Стартовое время для симуляции умного дома 00:00. Есть несколько датчиков: датчик температуры снаружи, 
датчик температуры внутри дома. В доме расположен электронный 
умный щиток с автоматами. Каждый автомат отвечает за включение и отключение определённых устройств или групп устройств: 
отключение и включение питания всего дома; 
основные розетки дома; 
свет внутри дома; 
наружный свет в саду; 
отопление в помещении; 
отопление водопровода, идущего из скважины с насосом; 
кондиционер в помещении.

Есть несколько условий по включению/отключению техники в доме и вне его.
Как только температура снаружи падает ниже 0 °С, надо включить систему обогрева водопровода. 
Если температура снаружи поднялась выше 5 °С, то систему обогрева водопровода нужно отключить.
Если на дворе вечер (время больше 16:00 и меньше 5:00 утра) и снаружи есть какое-то движение, 
то необходимо включить садовое освещение. Если движения нет или время не вечернее, то света снаружи быть не должно.
Если температура в помещении упала ниже 22 °С, должно включиться отопление. 
Как только температура равна или поднимается выше 25 °С, отопление автоматически отключается.
Если температура в помещении поднялась до 30 °С, включается кондиционер. 
Как только температура становится 25 °С, кондиционер отключается.
Всё освещение в доме также умное и поддерживает настройку цветовой 
температуры для комфортного нахождения. Каждый день начиная с 16:00 и до 20:00 
температура цвета должна плавно изменяться с 5000K до 2700К. Разумеется, это изменение 
должно происходить, если свет сейчас включён. В 00:00 температура сбрасывается до 5000К.
Все события по отключению и включению устройств должны выводиться в консоль явным образом. 
Если устройство не изменило своё состояние (осталось включённым или выключенным), событие 
генерироваться не должно! Если свет в доме включён, должна отображаться текущая цветовая температура.
*/